tap "buo/cask-upgrade"
tap "dschee/carthage-pro"
tap "facebook/fb"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "macvim-dev/macvim"
tap "mapbox/cli"
tap "neovim/neovim"
tap "pothosware/pothos"
tap "raggi/ale"
tap "rogual/neovim-dot-app"
tap "vapor/tap"
tap "yonaskolb/xcodegen", "https://github.com/yonaskolb/XcodeGen.git"
cask "xquartz"
brew "ack"
brew "adns"
brew "openssl"
brew "ossp-uuid"
brew "readline"
brew "sqlite"
brew "xz"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash-completion"
brew "gmp"
brew "isl"
brew "gcc"
brew "p7zip"
brew "python@2"
brew "ssdeep"
brew "binwalk"
brew "bison"
brew "brew-cask-completion"
brew "brew-gem"
brew "brew-pip"
brew "coreutils"
brew "gettext"
brew "libevent"
brew "tmux"
brew "byobu"
brew "freetype"
brew "libffi"
brew "nettle"
brew "gnutls"
brew "cask"
brew "ccat"
brew "cloc"
brew "cmake"
brew "cmark"
brew "colordiff"
brew "ctags"
brew "curl"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "docbook-xsl"
brew "exa"
brew "expat"
brew "fasd"
brew "fd"
brew "fdupes"
brew "findutils"
brew "foremost"
brew "gd"
brew "gem-bundle"
brew "gem-bundler"
brew "gem-fastlane"
brew "gem-rubocop"
brew "gem-xcake"
brew "git"
brew "git-credential-manager"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "git-standup"
brew "gnu-getopt"
brew "go"
brew "goenv"
brew "googler"
brew "gpg-agent"
brew "libtool"
brew "graphviz"
brew "gx"
brew "gx-go"
brew "icu4c"
brew "hh"
brew "hub"
brew "icoutils"
brew "libxml2"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "ipfs"
brew "jenv"
brew "legit"
brew "memcached"
brew "libmemcached"
brew "librsvg"
brew "libusb-compat"
brew "libyaml"
brew "m-cli"
brew "macvim", link: false
brew "make"
brew "mas"
brew "protobuf"
brew "mitmproxy"
brew "mkvtoolnix", args: ["with-qt"]
brew "mosh"
brew "mtr"
brew "mysql"
brew "nmap"
brew "node@8"
brew "nvm"
brew "openssl@1.1"
brew "pacvim"
brew "pmd"
brew "pv"
brew "qemu"
brew "ruby-build", args: ["HEAD"]
brew "rbenv", args: ["HEAD"]
brew "rename"
brew "s-search"
brew "screenfetch"
brew "source-highlight"
brew "sourcery"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sslsplit"
brew "swiftformat"
brew "swiftlint"
brew "tcpflow"
brew "thefuck"
brew "tldr"
brew "tree"
brew "utf8proc"
brew "v"
brew "vim"
brew "vimpager"
brew "wakatime-cli"
brew "watchman"
brew "wget"
brew "xcodegen"
brew "xcproj"
brew "xctool"
brew "xmake"
brew "xvid"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "dschee/carthage-pro/carthage-pro"
brew "facebook/fb/buck", args: ["HEAD"]
brew "raggi/ale/openssl-osx-ca"
brew "vapor/tap/vapor"
cask "amethyst"
cask "android-file-transfer"
cask "android-sdk"
cask "android-studio"
cask "astro"
cask "bettertouchtool"
cask "cheatsheet"
cask "cocoapods-app"
cask "contexts"
cask "google-backup-and-sync"
cask "google-chrome"
cask "grammarly"
cask "iina"
cask "imageoptim"
cask "inloop-qlplayground"
cask "iterm2-beta"
cask "java8"
cask "jetbrains-toolbox"
cask "macvim"
cask "mono-mdk"
cask "oni"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "setapp"
cask "sketch-beta"
cask "skype-preview"
cask "slack-beta"
cask "spotify"
cask "suspicious-package"
cask "telegram-desktop"
cask "torbrowser"
cask "viber"
cask "visual-studio-code"
cask "vlc"
cask "zeplin"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Swiftify for Xcode", id: 1183412116
mas "Xcode", id: 497799835
