tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "dschee/carthage-pro"
tap "fabsb/flutter"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "macvim-dev/macvim"
tap "mapbox/cli"
tap "neovim/neovim"
tap "pothosware/pothos"
tap "raggi/ale"
tap "rogual/neovim-dot-app"
tap "vapor/tap"
tap "yonaskolb/xcodegen", "https://github.com/yonaskolb/XcodeGen.git"
# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# SSL/TLS cryptography library
brew "openssl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Recursive piecewise hashing tool
brew "ssdeep"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Install pip packages as homebrew formulae
brew "brew-pip"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# Terminal multiplexer
brew "tmux"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Software library to render fonts
brew "freetype"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Strongly specified, highly compatible implementation of Markdown
brew "cmark"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Modern replacement for 'ls'
brew "exa"
# XML 1.0 parser
brew "expat"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Console program to recover files based on their headers and footers
brew "foremost"
# Graphics library to dynamically manipulate images
brew "gd"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Git extension to generate reports for standup meetings
brew "git-standup", link: false
# Command-line option parsing utility
brew "gnu-getopt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go version management
brew "goenv"
# Google Search and News from the command-line
brew "googler"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# The language-agnostic, universal package manager
brew "gx"
# Tool to use with the gx package manager for packages written in go
brew "gx-go"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Create and extract MS Windows icons and cursors
brew "icoutils"
# GNOME XML library
brew "libxml2"
# USB multiplexor daemon for iPhone and iPod Touch devices
brew "usbmuxd", args: ["HEAD"]
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Cross-platform library for communicating with iOS devices
brew "ideviceinstaller", args: ["HEAD"]
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# Manage your Java environment
brew "jenv"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# High performance, distributed memory object caching system
brew "memcached"
# C and C++ client library to the memcached server
brew "libmemcached"
# Library to render SVG files using Cairo
brew "librsvg"
# Library for USB device access
brew "libusb-compat"
# YAML Parser
brew "libyaml"
# Swiss Army Knife for macOS
brew "m-cli"
# GUI for vim, made for macOS
brew "macvim", link: false
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# CLI for Apple's Private (Closed) Mobile Device Framework
brew "mobiledevice"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@8"
# Manage multiple Node.js versions
brew "nvm"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Learn vim commands via a game
brew "pacvim"
# GNU Portable THreads
brew "pth"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# x86 and PowerPC Emulator
brew "qemu"
# Install various Ruby versions and implementations
brew "ruby-build", args: ["HEAD"]
# Ruby version manager
brew "rbenv", args: ["HEAD"]
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Web search from the terminal
brew "s-search"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Source-code syntax highlighter
brew "source-highlight"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Man-in-the-middle attacks against SSL encrypted network connections
brew "sslsplit"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# TCP flow recorder
brew "tcpflow"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Z for vim
brew "v"
# Vi 'workalike' with many additional features
brew "vim", link: false
# Use ViM as PAGER
brew "vimpager"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download and install various runtime libraries
brew "winetricks"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# A cross-platform build utility based on Lua
brew "xmake"
# Tracks most-used directories to make cd smarter
brew "z"
# GTK+ dialog boxes for the command-line
brew "zenity"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# The Dart SDK
brew "dart-lang/dart/dart"
brew "raggi/ale/openssl-osx-ca"
brew "vapor/tap/vapor"
cask "adobe-acrobat-pro"
cask "adobe-creative-cloud"
cask "amethyst"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anki"
cask "appcleaner"
cask "brooklyn"
cask "calibre"
cask "charles-beta"
cask "cheatsheet"
cask "clipy"
cask "contexts"
cask "copyq"
cask "font-hack"
cask "google-backup-and-sync"
cask "google-chrome"
cask "grammarly"
cask "hipchat"
cask "iina"
cask "imageoptim"
cask "inloop-qlplayground"
cask "iterm2-beta"
cask "java"
cask "jetbrains-toolbox"
cask "kindle"
cask "kindle-previewer"
cask "lulu"
cask "macdown"
cask "macvim"
cask "microsoft-office"
cask "muse"
cask "notion"
cask "onedrive"
cask "open-in-code"
cask "philips-hue-sync"
cask "postman"
cask "qbittorrent"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "setapp"
cask "sketch"
cask "skype-preview"
cask "slack-beta"
cask "spotify"
cask "steam"
cask "telegram-desktop"
cask "viber"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "wineskin-winery"
cask "wwdc"
cask "xquartz"
cask "zeplin"
cask "fabsb/flutter/flutter"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
