tap "raggi/ale"
tap "dschee/carthage", "https://github.com/Dschee/Carthage"
tap "pothosware/pothos"
tap "buo/cask-upgrade"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/services"
tap "yonaskolb/xcodegen", "https://github.com/yonaskolb/XcodeGen.git"
tap "rogual/neovim-dot-app"
tap "facebook/fb"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "mapbox/cli"
tap "macvim-dev/macvim"
tap "neovim/neovim"
cask "java"
cask "xquartz"
brew "ack"
brew "adns"
brew "ant"
brew "openssl"
brew "readline"
brew "sqlite"
brew "xz"
brew "python"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash-completion"
brew "gmp"
brew "isl"
brew "gcc"
brew "p7zip"
brew "python@2"
brew "ssdeep"
brew "binwalk"
brew "bison"
brew "brew-cask-completion"
brew "coreutils"
brew "gettext"
brew "libevent"
brew "tmux"
brew "byobu"
brew "carthage", link: false
brew "cask"
brew "ccat"
brew "cloc"
brew "cmark"
brew "cocoapods"
brew "colordiff"
brew "ctags"
brew "curl"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "docbook-xsl"
brew "duti"
brew "exa"
brew "expat"
brew "fasd"
brew "fd"
brew "fdupes"
brew "findutils"
brew "freetype"
brew "foremost"
brew "gd"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "libffi"
brew "nettle"
brew "gnutls"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "git-standup", link: false
brew "gnu-getopt"
brew "go"
brew "goenv"
brew "googler"
brew "gpg-agent"
brew "libtool"
brew "graphviz"
brew "gx"
brew "gx-go"
brew "hh"
brew "htop"
brew "hub"
brew "icoutils"
brew "icu4c"
brew "libxml2"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "ipfs", restart_service: true
brew "jenv"
brew "legit"
brew "memcached"
brew "libmemcached"
brew "libusb-compat"
brew "libyaml"
brew "m-cli"
brew "macvim"
brew "make"
brew "mas"
brew "protobuf"
brew "mitmproxy"
brew "mkvtoolnix", args: ["with-qt"]
brew "mosh"
brew "mtr"
brew "mysql"
brew "nmap"
brew "node"
brew "node@8"
brew "nvm"
brew "openssl@1.1"
brew "ossp-uuid"
brew "pacvim"
brew "php"
brew "php@5.6"
brew "pmd"
brew "pv"
brew "pyenv-virtualenv"
brew "qemu"
brew "ruby-build", args: ["HEAD"]
brew "rbenv", args: ["HEAD"]
brew "s-search"
brew "screenfetch"
brew "shellcheck"
brew "shfmt"
brew "source-highlight"
brew "sourcery", link: false
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sslsplit"
brew "swiftformat"
brew "swiftlint"
brew "tcpflow"
brew "thefuck"
brew "tldr"
brew "tree"
brew "utf8proc"
brew "v"
brew "vim", args: ["HEAD", "with-luajit", "with-override-system-vi"]
brew "vimpager"
brew "watchman"
brew "wget"
brew "xcproj"
brew "xctool"
brew "xmake"
brew "xvid"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "facebook/fb/buck", args: ["HEAD"]
brew "raggi/ale/openssl-osx-ca"
brew "yonaskolb/xcodegen/xcodegen"
cask "amethyst"
cask "android-file-transfer"
cask "android-studio"
cask "appcode"
cask "apppolice"
cask "arduino"
cask "astro"
cask "cakebrew"
cask "calibre"
cask "cheatsheet"
cask "cocoapods-app"
cask "colorpicker-antetype"
cask "colorpicker-developer"
cask "colorpicker-skalacolor"
cask "contexts"
cask "google-backup-and-sync"
cask "google-chrome"
cask "grammarly"
cask "iina"
cask "imageoptim"
cask "inloop-qlplayground"
cask "keybase"
cask "lepton"
cask "macvim"
cask "menubar-colors"
cask "mono-mdk"
cask "noti"
cask "pusher"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicksilver"
cask "setapp"
cask "slack"
cask "sloth"
cask "smcfancontrol"
cask "spotify"
cask "suspicious-package"
cask "telegram-desktop"
cask "textmate"
cask "torbrowser"
cask "viber"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/java8"
cask "caskroom/versions/skype-preview"
mas "GarageBand", id: 682658836
mas "Numbers", id: 409203825
mas "OhMyStar2", id: 1218642292
mas "Pages", id: 409201541
